import { PagePrivacyPolicyKeys } from "@/i18n/resources/types";

const PagePrivacyPolicy_RU = {
  title: "Политика конфиденциальности",

  section1Title: "1. Введение",
  section1Content:
    "Добро пожаловать в Study Buddy! Ваша конфиденциальность важна для нас. Данная Политика конфиденциальности объясняет, как мы собираем, используем и защищаем ваши данные. Используя Study Buddy, вы соглашаетесь с условиями, описанными в данной политике.",

  section2Title: "2. Какие данные мы собираем",
  section2Content: "Мы собираем следующие типы данных:",

  personalInfoTitle: "Личная информация",
  personalInfoContent: "Адрес электронной почты, имя пользователя и информация профиля.",

  usageDataTitle: "Данные об использовании",
  usageDataContent:
    "Информация о вашем взаимодействии с приложением, включая результаты викторин, сообщения в чате и время, проведенное в различных функциях.",

  deviceDataTitle: "Данные устройства",
  deviceDataContent:
    "Информация о вашем устройстве, например, операционная система и тип устройства, чтобы обеспечить стабильную работу приложения.",

  section3Title: "3. Как мы используем ваши данные",
  section3Content: "Мы используем ваши данные для:",

  useData1: "Предоставления и улучшения наших услуг.",
  useData2: "Настройки контента и функций в соответствии с вашими предпочтениями.",
  useData3: "Обеспечения чатов и взаимодействия с другими пользователями.",
  useData4: "Создания викторин и учебных рекомендаций.",
  useData5: "Показа рекламы для поддержания бесплатного доступа к Study Buddy.",

  section4Title: "4. Передача данных",
  section4Content: "Мы не продаем ваши данные. Мы можем делиться вашими данными с:",

  sharing1Title: "Поставщиками услуг",
  sharing1Content: "Для помощи в аналитике, хостинге и рекламе.",

  sharing2Title: "Правоохранительными органами",
  sharing2Content: "Если это требуется по закону или для защиты наших прав.",

  section5Title: "5. Безопасность",
  section5Content:
    "Мы используем шифрование и другие меры безопасности для защиты ваших данных. Однако ни один метод передачи данных через интернет не является на 100% безопасным.",

  section6Title: "6. Ваши права",
  section6Content: "Вы имеете право:",

  right1: "Получить доступ к вашим данным.",
  right2: "Запросить удаление вашего аккаунта и данных.",
  right3: "Отказаться от сбора определенных данных (например, аналитика или реклама).",
  exerciseRightsContent:
    "Для реализации этих прав свяжитесь с нами по адресу support@studybuddy.com.",

  section7Title: "7. Изменения в данной политике",
  section7Content:
    "Мы можем периодически обновлять Политику конфиденциальности. Мы уведомим вас об изменениях через приложение или по электронной почте.",

  section8Title: "8. Свяжитесь с нами",
  section8Content:
    "Если у вас есть вопросы или замечания по поводу Политики конфиденциальности, свяжитесь с нами по адресу {{email}}",
} satisfies PagePrivacyPolicyKeys;

export default PagePrivacyPolicy_RU;
